project04/app/views/articles/index.html.erb

SELECT "articles".* FROM "articles"
---

<p><%= pluralize(@articles.count, "article") %></p>