project03/work/depot/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 06 Feb 2012 22:30:43 UTC +00:00], ["updated_at", Mon, 06 Feb 2012 22:30:43 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 10], ["created_at", Tue, 07 Feb 2012 06:22:47 UTC +00:00], ["order_id", nil], ["product_id", 10], ["quantity", 1], ["updated_at", Tue, 07 Feb 2012 06:22:47 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-02-07 00:16:47.882845' WHERE "line_items"."id" = 4
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save