project03/work/depot/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 11
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 11
---
  def new
    @cart = current_cart

    if @cart.line_items.empty?

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 12]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])