project03/work/depot/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]