project04/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "adfda"], ["created_at", Fri, 17 Feb 2012 03:55:08 UTC +00:00], ["name", "adfa"], ["title", "a"], ["updated_at", Fri, 17 Feb 2012 03:55:08 UTC +00:00]]

  def update
    @article = Article.find(params[:id])
    @article.count +=1

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "articles" SET "content" = 'Magna readymade duis swag dolor etsy. Laboris consectetur cardigan terry richardson fingerstache, photo booth you probably haven''t heard of them single-origin coffee hella excepteur seitan pop-up pickled cupidatat. Ethical mlkshk 3 wolf moon post-ironic sed. DIY banksy cray, fixie consequat laborum nisi nulla. Wayfarers fanny pack vice, odd future readymade vegan fugiat lomo do mumblecore american apparel eu. Blog quis mumblecore, commodo marfa officia ennui. Beard direct trade ethnic accusamus, gastropub voluptate labore master cleanse +1 skateboard ea sapiente.

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]