project06/app/controllers/games_controller.rb

  def index
    @games_count = Game.count
    @games = Game.search(params[:search], params[:page])
---
SELECT COUNT(*) FROM "games"
SELECT "games".* FROM "games" LIMIT 5 OFFSET 0

  def edit
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @game = Game.new(params[:game])


    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "rating", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 11 Apr 2012 09:15:09 UTC +00:00], ["rating", ""], ["title", ""], ["updated_at", Wed, 11 Apr 2012 09:15:09 UTC +00:00]]

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]