project06/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Wed, 11 Apr 2012 09:15:26 UTC +00:00], ["email", ""], ["first_name", ""], ["last_name", ""], ["password", ""], ["updated_at", Wed, 11 Apr 2012 09:15:26 UTC +00:00], ["username", ""]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save